server/src/cf/Catalogs/Подсчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Подсчеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтролерКачества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБракованнойПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

server/src/cf/HTTPServices/Exchange/Ext/Module.bsl
Функция SendCountSendCount(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	//Создаем новую переменную для расшифровки
	//полученных данных из мобильного приложения
	ЧтениеJSON = Новый ЧтениеJSON();
	
	//Устанавливаем текст, который хотим расшифровать
	//Мы его отправляем в параметре "SendCount"
	ЧтениеJSON.УстановитьСтроку(Запрос.ПараметрыЗапроса.Получить("SendCount"));
	
	//Записываем в переменную "Подсчет" расшифрованные данные
	Подсчет = ПрочитатьJSON(ЧтениеJSON);
	
	//Закрываем чтение, так как оно нам больше не нужно
	ЧтениеJSON.Закрыть();
	
	//Начинаем записывать достижения в справочник
	
	//Создаем новый элемент в справочнике
	НовыйПодсчет = Справочники.Подсчеты.СоздатьЭлемент();
	
	//Заполняем поля наименование, контролер и количество брака
	НовыйПодсчет.Наименование = Подсчет.Наименование;
	НовыйПодсчет.КонтролерКачества = Подсчет.КонтролерКачества;
	НовыйПодсчет.КоличествоБракованнойПродукции = Подсчет.КоличествоБракованнойПродукции;
	
	//Записываем подсчет
	НовыйПодсчет.Записать();
	
	//Возвращаем строку "Данные записаны" HTTP-сервису
	Ответ.УстановитьТелоИзСтроки("Данные записаны", КодировкаТекста.ANSI);
	
	Возврат Ответ;

КонецФункции
